htibosch/Lab-Project-FreeRTOS-FAT/portable/STM32F7xx_slot.2/ff_sddisk.c
    if( ( pxDisk != NULL ) &&
        ( xSDCardStatus == pdPASS ) &&
        ( pxDisk->ulSignature == sdSIGNATURE ) &&
        ( pxDisk->xStatus.bIsInitialised != pdFALSE ) &&
        ( ulSectorNumber < pxDisk->ulNumberOfSectors ) &&
        ( ( pxDisk->ulNumberOfSectors - ulSectorNumber ) >= ulSectorCount ) )
    {
        HAL_SD_ErrorTypedef sd_result;
        uint64_t ullWriteAddr;
        ullWriteAddr = ( uint64_t ) 512U * ( uint64_t ) ulSectorNumber;

        #if ( SDIO_USES_DMA == 0 )
        {
            sd_result = HAL_SD_WriteBlocks( &xSDHandle, ( uint32_t * ) pucBuffer, ullWriteAddr, ulSectorCount );
        }
        #else
        {
            /* Is the buffer aligned with a cache line? */
            if( ( ( ( uintptr_t ) pucBuffer ) & CACHE_LINE_BITS ) == 0U )
            {
                /* The buffer is word-aligned, call DMA write directly. */
                if( xIsCacheable( ( uint32_t ) pucBuffer ) != pdFALSE )
                {
                    prvCacheClean( ( uint32_t * ) pucBuffer, 512U * ulSectorCount );
                }

                sd_result = HAL_SD_WriteBlocks_DMA( &xSDHandle, ( uint32_t * ) pucBuffer, ullWriteAddr, ulSectorCount );

                if( sd_result == SD_OK )
                {
                    sd_result = HAL_SD_CheckWriteOperation( &xSDHandle, sdMAX_TIME_TICKS );
                }
            }
            else
            {
                uint32_t ulSector;

                /* The buffer is NOT word-aligned, read to an aligned buffer and then
                 * copy the data to the user provided buffer. */
                sd_result = SD_OK;

                for( ulSector = 0; ulSector < ulSectorCount; ulSector++ )
                {
                    memcpy( pucDMABuffer, pucBuffer + 512U * ulSector, 512U );
                    ullWriteAddr = ( uint64_t ) 512U * ( ulSectorNumber + ulSector );

                    if( xIsCacheable( ( uint32_t ) pucDMABuffer ) != pdFALSE )
                    {
                        prvCacheClean( ( uint32_t * ) pucDMABuffer, 512U );
                    }

                    sd_result = HAL_SD_WriteBlocks_DMA( &xSDHandle, ( uint32_t * ) pucDMABuffer, ullWriteAddr, 1U );

                    if( sd_result == SD_OK )
                    {
                        sd_result = HAL_SD_CheckWriteOperation( &xSDHandle, sdMAX_TIME_TICKS );

                        if( sd_result != SD_OK )
                        {
                            break;
                        }
                    }
                }
            }
        }
        #endif /* SDIO_USES_DMA */

        if( sd_result == SD_OK )
        {
            /* No errors. */
            lReturnCode = 0L;
        }
        else
        {
            FF_PRINTF( "prvFFWrite: %u: %lu (%s)\n", ( unsigned ) ulSectorNumber, sd_result, prvSDCodePrintable( sd_result ) );
        }
    }
    else
    {
        if( pxDisk->xStatus.bIsInitialised != pdFALSE )
        {
            FF_PRINTF( "prvFFWrite: warning: %u + %u > %u\n", ( unsigned ) ulSectorNumber, ( unsigned ) ulSectorCount, ( unsigned ) pxDisk->ulNumberOfSectors );
        }
    }

    return lReturnCode;
}
/*-----------------------------------------------------------*/

#ifdef STM32F7xx
    static void prvCacheClean( uint32_t * pulAddress,
                               int32_t ulSize )
    {
        SCB_CleanDCache_by_Addr( pulAddress, ulSize );
    }
/*-----------------------------------------------------------*/
#endif /* STM32F7xx */

#ifdef STM32F7xx
    static void prvCacheInvalidate( uint32_t * pulAddress,
                                    int32_t ulSize )
    {
        SCB_InvalidateDCache_by_Addr( pulAddress, ulSize );
    }
/*-----------------------------------------------------------*/
#endif /* STM32F7xx */

void FF_SDDiskFlush( FF_Disk_t * pxDisk )
{
    if( ( pxDisk != NULL ) &&
        ( pxDisk->xStatus.bIsInitialised != pdFALSE ) &&
        ( pxDisk->pxIOManager != NULL ) )
    {
        FF_FlushCache( pxDisk->pxIOManager );
    }
}
/*-----------------------------------------------------------*/


/* void enableInterrupts( int aValue ); */

static void vGPIO_SD_Init( SD_HandleTypeDef * xSDHandle )
{
    GPIO_InitTypeDef GPIO_InitStruct;

/*	enableInterrupts (0); */
    if( xSDHandle->Instance == SDIO_Instance )
    {
        /* Peripheral clock enable */
        __SDIO_CLK_ENABLE();

        /* Enable DMA2 clocks */
        __DMAx_TxRx_CLK_ENABLE();

        memset( &( GPIO_InitStruct ), 0, sizeof( GPIO_InitStruct ) );

        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
/*		GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH; */
        GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;

        #if ( STM_USE_SDMMC2 == 1 )
        {
            /**SDIO GPIO Configuration
             * PB14    ------> SDIO_D0
             * PB15    ------> SDIO_D1
             * PG11    ------> SDIO_D2
             * PB4     ------> SDIO_D3
             * PD6     ------> SDIO_CK
             * PD7     ------> SDIO_CMD
             */

            __HAL_RCC_SDMMC2_CLK_ENABLE();
        }
        #else /* STM_USE_SDMMC2 == 0 */
        {
            /**SDIO GPIO Configuration
             * PC8     ------> SDIO_D0
             * PC9     ------> SDIO_D1
             * PC10    ------> SDIO_D2
             * PC11    ------> SDIO_D3
             * PC12    ------> SDIO_CK
             * PD2     ------> SDIO_CMD
             */

            GPIO_InitStruct.Alternate = GPIO_AF12_SDMMC1;

            /* Enable SDIO clock */
            __HAL_RCC_SDMMC1_CLK_ENABLE();

            /* Enable GPIOs clock */
            __HAL_RCC_GPIOC_CLK_ENABLE();
            __HAL_RCC_GPIOD_CLK_ENABLE();

            /* GPIOC configuration */
            #if ( BUS_4BITS != 0 )
            {
                GPIO_InitStruct.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
            }
            #else
            {
                GPIO_InitStruct.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_12;
            }
            #endif
            HAL_GPIO_Init( GPIOC, &GPIO_InitStruct );

            /* GPIOD configuration */
            GPIO_InitStruct.Pin = GPIO_PIN_2;
            HAL_GPIO_Init( GPIOD, &GPIO_InitStruct );
        }
        #endif /* STM_USE_SDMMC2 == 0 */
    }
}
/*-----------------------------------------------------------*/

