htibosch/Lab-Project-FreeRTOS-FAT/portable/STM32F7xx_slot.2/ff_sddisk.c
static const char * prvSDCodePrintable( uint32_t ulCode )
{
    static char retString[ 32 ];
    const struct xCODE_NAME * pxCode;

    for( pxCode = xSD_CODES; pxCode <= xSD_CODES + sdARRAY_SIZE( xSD_CODES ) - 1; pxCode++ )
    {
        if( pxCode->ulValue == ulCode )
        {
            return pxCode->pcName;
        }
    }

    snprintf( retString, sizeof( retString ), "SD code %lu\n", ulCode );
    return retString;
}
/*-----------------------------------------------------------*/

#if ( SDIO_USES_DMA != 0 )
    DMA_HandleTypeDef xRxDMAHandle;
    DMA_HandleTypeDef xTxDMAHandle;

    static void prvSDIO_DMA_Init( void )
    {
        /* Enable DMA2 clocks */
        __DMAx_TxRx_CLK_ENABLE();

        /* NVIC configuration for SDIO interrupts */
        HAL_NVIC_SetPriority( SDIO_IRQ_number, configSDIO_DMA_INTERRUPT_PRIORITY, 0 );
        HAL_NVIC_EnableIRQ( SDIO_IRQ_number );

        /* Configure DMA Rx parameters */
        xRxDMAHandle.Init.Channel = SD_DMAx_Rx_CHANNEL;
        xRxDMAHandle.Init.Direction = DMA_PERIPH_TO_MEMORY;
        /* Peripheral address is fixed (FIFO). */
        xRxDMAHandle.Init.PeriphInc = DMA_PINC_DISABLE;
        /* Memory address increases. */
        xRxDMAHandle.Init.MemInc = DMA_MINC_ENABLE;
        xRxDMAHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
        xRxDMAHandle.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
        /* The peripheral has flow-control. */
        xRxDMAHandle.Init.Mode = DMA_PFCTRL;
        xRxDMAHandle.Init.Priority = DMA_PRIORITY_VERY_HIGH;
        xRxDMAHandle.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
        xRxDMAHandle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
/*		xRxDMAHandle.Init.MemBurst = DMA_MBURST_SINGLE;// DMA_MBURST_INC4; */
        xRxDMAHandle.Init.MemBurst = DMA_MBURST_INC4;
        xRxDMAHandle.Init.PeriphBurst = DMA_PBURST_INC4;

        /* DMA2_Stream3. */
        xRxDMAHandle.Instance = SD_DMAx_Rx_STREAM;

        /* Configure the DMA stream */
        HAL_DMA_Init( &xRxDMAHandle );

        /* Associate the DMA handle */
        __HAL_LINKDMA( &xSDHandle, hdmarx, xRxDMAHandle );

        /* Configure DMA Tx parameters */
        xTxDMAHandle.Init.Channel = SD_DMAx_Tx_CHANNEL;
        xTxDMAHandle.Init.Direction = DMA_MEMORY_TO_PERIPH;
        xTxDMAHandle.Init.PeriphInc = DMA_PINC_DISABLE;
        xTxDMAHandle.Init.MemInc = DMA_MINC_ENABLE;
        xTxDMAHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
        xTxDMAHandle.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
        xTxDMAHandle.Init.Mode = DMA_PFCTRL;
        xTxDMAHandle.Init.Priority = DMA_PRIORITY_VERY_HIGH;
        xTxDMAHandle.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
        xTxDMAHandle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
        xTxDMAHandle.Init.MemBurst = DMA_MBURST_SINGLE;
        xTxDMAHandle.Init.PeriphBurst = DMA_PBURST_INC4;

        xTxDMAHandle.Instance = SD_DMAx_Tx_STREAM;
        /* Configure the DMA stream */
        HAL_DMA_Init( &xTxDMAHandle );

        /* Associate the DMA handle */
        __HAL_LINKDMA( &xSDHandle, hdmatx, xTxDMAHandle );

        /* NVIC configuration for DMA transfer complete interrupt */
        HAL_NVIC_SetPriority( SD_DMAx_Rx_IRQn, configSDIO_DMA_INTERRUPT_PRIORITY + 2, 0 );
        HAL_NVIC_EnableIRQ( SD_DMAx_Rx_IRQn );

        /* NVIC configuration for DMA transfer complete interrupt */
        HAL_NVIC_SetPriority( SD_DMAx_Tx_IRQn, configSDIO_DMA_INTERRUPT_PRIORITY + 2, 0 );
        HAL_NVIC_EnableIRQ( SD_DMAx_Tx_IRQn );
    }
#endif /* SDIO_USES_DMA */
/*-----------------------------------------------------------*/

#if ( SDIO_USES_DMA != 0 )

/* Note that 'SDIO_IRQ_Handler' is a macro, either defined as
 * 'SDMMC1_IRQHandler', or as 'SDMMC2_IRQHandler'
 */
    void SDIO_IRQ_Handler( void )
    {
        BaseType_t xHigherPriorityTaskWoken = 0;

        HAL_SD_IRQHandler( &xSDHandle );

        if( xSDCardSemaphore != NULL )
        {
            xSemaphoreGiveFromISR( xSDCardSemaphore, &xHigherPriorityTaskWoken );
        }

        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }

#endif /* SDIO_USES_DMA */
/*-----------------------------------------------------------*/

#if ( SDIO_USES_DMA != 0 )

/* Note that 'DMA2_TX_stream_IRQHandler' is a macro, possible defined as
 * DMA2_Stream5_IRQHandler or DMA2_Stream6_IRQHandler */
    void DMA2_TX_stream_IRQHandler( void )
    {
        BaseType_t xHigherPriorityTaskWoken = 0;

        /* DMA SDIO-TX interrupt handler. */
        HAL_DMA_IRQHandler( xSDHandle.hdmatx );

        if( xSDCardSemaphore != NULL )
        {
            xSemaphoreGiveFromISR( xSDCardSemaphore, &xHigherPriorityTaskWoken );
        }

        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }

#endif /* SDIO_USES_DMA */
/*-----------------------------------------------------------*/

#if ( SDIO_USES_DMA != 0 )

/* Note that 'DMA2_RX_stream_IRQHandler' is a macro, possible defined as
 * DMA2_Stream0_IRQHandler or DMA2_Stream3_IRQHandler */
    void DMA2_RX_stream_IRQHandler( void )
    {
        BaseType_t xHigherPriorityTaskWoken = 0;

        /* DMA SDIO-RX interrupt handler. */
        HAL_DMA_IRQHandler( xSDHandle.hdmarx );

        if( xSDCardSemaphore != NULL )
        {
            xSemaphoreGiveFromISR( xSDCardSemaphore, &xHigherPriorityTaskWoken );
        }

        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }

#endif /* SDIO_USES_DMA */
/*-----------------------------------------------------------*/

#if ( SDIO_USES_DMA != 0 )

    static void prvEventSetupFunction( SD_HandleTypeDef * pxHandle )
    {
        /* A DMA transfer to or from the SD-card is about to start.
         * Reset the timers that will be used in prvEventWaitFunction() */
        xDMARemainingTime = sdMAX_TIME_TICKS;
        vTaskSetTimeOutState( &xDMATimeOut );
    }

#endif /* SDIO_USES_DMA != 0 */
/*-----------------------------------------------------------*/

#if ( SDIO_USES_DMA != 0 )

    static uint32_t prvEventWaitFunction( SD_HandleTypeDef * pxHandle )
    {
        uint32_t ulReturn = 1U;

        /*
         * It was measured how quickly a DMA interrupt was received. It varied
         * between 0 and 4 ms.
         * <= 1 ms : 8047
         * <= 2 ms : 1850
         * <= 3 ms :   99
         * <= 4 ms :   79
         * >= 5 ms :    0 times
         */

        if( xTaskCheckForTimeOut( &xDMATimeOut, &xDMARemainingTime ) == pdFALSE )
        {
            /* The timeout has not been reached yet, block on the semaphore. */
            xSemaphoreTake( xSDCardSemaphore, xDMARemainingTime );

            if( xTaskCheckForTimeOut( &xDMATimeOut, &xDMARemainingTime ) == pdFALSE )
            {
                ulReturn = 0U;
            }
        }

        return ulReturn;
    }

#endif /* SDIO_USES_DMA != 0 */
/*-----------------------------------------------------------*/

void HAL_GPIO_EXTI_Callback( uint16_t GPIO_Pin )
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    if( GPIO_Pin == configSD_DETECT_PIN )
    {
        vApplicationCardDetectChangeHookFromISR( &xHigherPriorityTaskWoken );
        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }
}
/*-----------------------------------------------------------*/

void EXTI15_10_IRQHandler( void )
{
    HAL_GPIO_EXTI_IRQHandler( configSD_DETECT_PIN ); /* GPIO PIN H.13 */
}
/*-----------------------------------------------------------*/
